# Вычислить число c заданной точностью d
# Пример:
# - при $d = 0.001, π = 3.141.$    $10^{-1} ≤ d ≤10^{-10}$

a = int(input('Введите число d: '))
pi = 0
for i in range(1, 1000000):
    pi += 4 * ((-1) ** (i+1)) / (2 * i - 1)
print(str(pi)[:a+2])
