# Напишите программу, которая принимает на вход два числа и проверяет, является ли одно число квадратом другого.        
# *Примеры:*           - 5, 25 -> да     - 4, 16 -> да     - 25, 5 -> да     - 8,9 -> нет 
print("введите а")
print("введите b")
a=int(input())
b=int(input())

if (a*a)==b:
    print("b является квадратом a")
elif (b*b)==a:
    print("a является квадратом b")
else:
    print("числа не являются квадратами друг друга")
